app_documento/app/controllers/documentos_controller.rb

SELECT "documentos".* FROM "documentos" ORDER BY producto_id, TipoDocumento_id, fecha_vencimiento DESC
---
  def index
    #Todos los documentos ordenados por producto, tipo y fecha de vencimiento
    @documentos = Documento.order("producto_id").order("TipoDocumento_id").order("fecha_vencimiento DESC").all

SELECT "presentacions".* FROM "presentacions" WHERE "presentacions"."productos_id" = 5
SELECT "importadors".* FROM "importadors" WHERE "importadors"."productos_id" = 5
---
  def new
    @documento = Documento.new
    @documento.TipoDocumento = TipoDocumento.new
    @tipos = get_tipoDoc
    @presentaciones = Presentacion.where(:productos_id => params[:producto_id])
    @importadores = Importador.where(:productos_id => params[:producto_id])