app_documento/app/controllers/inicio_controller.rb

  def index
    if current_usuario.admin > 0
      @tablader = Tramite.all
    else
      session[:alerts] = Vencidos.order("fecha").where(:usuario_id => current_usuario.id)
---
SELECT "tramites".* FROM "tramites"
SELECT "vencidos".* FROM "vencidos" WHERE "vencidos"."usuario_id" = 1 ORDER BY fecha