app_documento/app/controllers/logdocumento_controller.rb

  def index
    @logdocumentos = Logdocumento.all
---
SELECT "logdocumentos".* FROM "logdocumentos" ORDER BY created_at DESC