app_documento/app/controllers/logproductos_controller.rb

  def index
    @logproductos = Logproducto.all
---
SELECT "logproductos".* FROM "logproductos" ORDER BY created_at DESC