app_documento/app/controllers/logsesions_controller.rb

SELECT "logsesions".* FROM "logsesions" ORDER BY created_at DESC
---
  def index
    @logsesions = Logsesion.all