app_documento/app/controllers/logtramite_controller.rb

SELECT "logtramites".* FROM "logtramites" ORDER BY created_at DESC
---
  def index
    @logtramites = Logtramite.all