app_documento/app/controllers/productos_controller.rb

  def index
    if current_usuario.admin != 0

      flash[:title] = "Productos"
      clientes      = Cliente.where(:usuario_id => current_usuario.id)
      clientesIds   = clientes.map{ |x| x.cliente_id }
      productosT    = Producto.all

      if current_usuario.admin == 2
        @productos = productosT
      else
        @productos = []
        productosT.each do |p|
          @productos << p unless not clientesIds.include? p.usuario.id
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."usuario_id" = 1
SELECT "productos".* FROM "productos"
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1

  def show
    @producto = Producto.find(params[:id])
    @cliente = Usuario.find(@producto.usuario_id)
    flash.keep
    @documentos = get_documentos(@producto.id, current_usuario.admin > 0 )
    @presentaciones = Presentacion.where(:productos_id => @producto.id)
    @importadores_todos = Importador.all

    logp = Logproducto.new(:usuario_id => current_usuario.id,
                           :producto_id => @producto.id,
                           :tipo => "Visualizado",
                           :nusuario => current_usuario.nombre,
                           :nproducto => @producto.nombre)

    if logp.save
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT 1  [["id", "5"]]
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1
SELECT "importadors".* FROM "importadors"
INSERT INTO "logproductos" ("created_at", "nproducto", "nusuario", "producto_id", "tipo", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def new
    @producto = Producto.new
    @producto.alimento = true   #Para que aparezca un default en el select
    usuarios = Usuario.where(:admin => 0)     #Para coleccion del dueño del producto
    prod = Producto.all
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."admin" = 0
SELECT "productos".* FROM "productos"

  def create
    @producto = Producto.new(params[:producto])

    respond_to do |format|
      if @producto.save
---
INSERT INTO "productos" ("alimento", "codigo_arancelario", "created_at", "fabricante", "grado_alcoholico", "marca", "nombre", "on", "pais_elaboracion", "registro_sanitario", "updated_at", "usuario_id", "zona_venta") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def new_create_documentos
    @producto       = Producto.find( params[:producto_id] )
    @presentaciones = Presentacion.where(:productos_id => params[:producto_id])
    @importadores   = Importador.where(:productos_id => params[:producto_id])
    @tipos          = TipoDocumento.all
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT 1  [["id", "5"]]
SELECT "documentos".* FROM "documentos" WHERE "documentos"."producto_id" = 5