app_documento/app/controllers/requisitos_controller.rb

SELECT "requisitos".* FROM "requisitos" WHERE "requisitos"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @requisito = Requisito.find(params[:id])