app_documento/app/controllers/sessions_controller.rb

  def create
    puts "----------------"
    puts "INICIANDO SESION"
    puts "----------------"

    super
    logs = Logsesion.new(:usuario_id => current_usuario.id,
                         :superu_id => current_usuario.id,
                         :tipo => "Login",
                         :nusuario => current_usuario.login,
                         :nsuperu => current_usuario.login)

    logs.save
---
INSERT INTO "logsesions" ("created_at", "nsuperu", "nusuario", "superu_id", "tipo", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    puts "----------------"
    puts "CERRANDO SESION"
    puts "----------------"

    logs = Logsesion.new(:usuario_id => current_usuario.id,
                         :superu_id => current_usuario.id,
                         :tipo => "Logout",
                         :nusuario => current_usuario.login,
                         :nsuperu => current_usuario.login)

    logs.save
---
INSERT INTO "logsesions" ("created_at", "nsuperu", "nusuario", "superu_id", "tipo", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?, ?)