app_documento/app/controllers/tramites_controller.rb

  def new
      if current_usuario.admin == 0
          @productos = Producto.where(:usuario_id => current_usuario.id)
      else
          @productos = Producto.all
---
SELECT "productos".* FROM "productos"