app_documento/app/controllers/tramites_controller.rb

  def index
    #Seleccion de tramites a mostrar
    if current_usuario.admin == 0
        flash[:title] = "Mis solicitudes"
        @tramites = Tramite.where(:usuario_id => current_usuario.id)
    else
        flash[:title] = "Solicitudes"
        @tramites = Tramite.all
    end

    @documentos = TipoDocumento.all
---
SELECT "tramites".* FROM "tramites"
SELECT "tipo_documentos".* FROM "tipo_documentos" ORDER BY id DESC

  def show
    @tramite = Tramite.find(params[:id])
---
SELECT "tramites".* FROM "tramites" WHERE "tramites"."id" = $1 LIMIT 1  [["id", "1"]]

  def new
      @productos = get_products(current_usuario)
      @tipos     = TipoDocumento.all
---
SELECT "tipo_documentos".* FROM "tipo_documentos"

  def edit
    @tramite = Tramite.find(params[:id])
---
SELECT "tramites".* FROM "tramites" WHERE "tramites"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @tramite = Tramite.new(params[:tramite])
    if not @tramite.producto_id.is_a? Integer
        @tramite.producto_id = nil
    end

    @tramite.estado = 0
    @tramite.usuario_id = current_usuario.id
    crear_requisitos(@tramite.TipoDocumento_id, @tramite)
    respond_to do |format|
      if @tramite.save
        @logt = Logtramite.new(:usuario_id => current_usuario.id,
                               :tramite_id => @tramite.id, :tipo => 'Creado',
                               :nusuario => current_usuario.nombre,
                               :ntipodocumento => @tramite.TipoDocumento.descripcion,
                               :nproducto => @tramite.producto.nombre,
                               :producto_id => @tramite.producto.id)
        if @logt.save
          format.html { redirect_to tramites_path, notice: 'Tramite creado. Log actualizado' }
          format.json { render json: tramites_path, status: :created, location: @tramite }
        else
          format.html { redirect_to tramites_path, notice: 'Tramite creado. Log no actualizado.' }
          format.json { render json: tramites_path, status: :created, location: @tramite }
        end
      else
        @productos = get_products(current_usuario)
        @tipos     = TipoDocumento.all
---
INSERT INTO "requisitos" ("TipoRequisito_id", "created_at", "descripcion", "estado", "observacion", "tramite_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "tramites" ("TipoDocumento_id", "codigo_seguimiento", "created_at", "documento", "estado", "fecha_recepcion", "observacion", "producto_id", "recibido", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "logtramites" ("created_at", "nproducto", "ntipodocumento", "nusuario", "producto_id", "tipo", "tramite_id", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "tipo_documentos".* FROM "tipo_documentos"

  def check
      @tramite = Tramite.find(params[:id])
      #Si se le dio a rechazar, se elimina.
      if params[:tramite][:recibido] == "false"
          @tramite.destroy
          redirect_to tramites_path
      #Si se le dio a aceptar, se pone visible
      else
          @tramite.update_attributes(params[:tramite])
---
SELECT "tramites".* FROM "tramites" WHERE "tramites"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "tramites" SET "recibido" = 't', "fecha_recepcion" = '2014-01-04', "estado" = 1, "updated_at" = '2014-01-05 04:19:07.956038' WHERE "tramites"."id" = 1

  def update_requisitos
    @tramite = Tramite.find(params[:requisito][:id])

    requisitos = @tramite.requisitos
    lista = []
    req = ''
    requisitos.each do |r|
        estado = params[:requisito][("estado"+r.id.to_s).to_sym]
        #Solo se cambia atributos si tienen valor o no son iguales.
        if estado.nil? or estado == r.estado.to_s
            next
        end
        observacion = params[:requisito][("observacion"+r.id.to_s).to_sym]
        lista << r
        r.update_attribute(:estado, estado)
---
SELECT "requisitos".* FROM "requisitos" WHERE "requisitos"."tramite_id" = 1
SELECT "tramites".* FROM "tramites" WHERE "tramites"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "requisitos" SET "observacion" = 'bla', "updated_at" = '2014-01-05 04:19:20.464659' WHERE "requisitos"."id" = 1