app_documento/app/views/logsesions/index.html.erb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1
---
                  <%= l.nsuperu %>
                <!-- <%= link_to Usuario.find(l.superu_id) do %>